perl/CreditVoid.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hps="http://Hps.Exchange.PosGateway">
  <soapenv:Header/>
  <soapenv:Body>
    <hps:PosRequest clientType="" clientVer="">
      <hps:Ver1.0>
        <hps:Header>
          <hps:DeveloperID>123456</hps:DeveloperID>
          <hps:VersionNbr>1234</hps:VersionNbr>
          <hps:SecretAPIKey>skapi_cert_MYl2AQAowiQAbLp5JesGKh7QFkcizOP2jcX9BrEMqQ</hps:SecretAPIKey>
        </hps:Header>
        <hps:Transaction>
          <hps:CreditVoid>
            <hps:GatewayTxnId>6555639</hps:GatewayTxnId>
          </hps:CreditVoid>
        </hps:Transaction>
      </hps:Ver1.0>
    </hps:PosRequest>
  </soapenv:Body>
</soapenv:Envelope>
